{
  "tasks": [
    {
      "id": "0acbdc72-64d7-411b-8651-ce1498dac04c",
      "subject": "איחוד לוגיקת סריקות לסריקה מתקדמת",
      "subtasks": [
        "איסוף דרישות והגדרת מדדי הצלחה ל-איחוד לוגיקת סריקות לסריקה מתקדמת",
        "פיתוח והטמעה של איחוד לוגיקת סריקות לסריקה מתקדמת",
        "בדיקות, fine tuning והשקה מבוקרת עבור איחוד לוגיקת סריקות לסריקה מתקדמת"
      ],
      "expert_review": {
        "design_lead": "לבנות חוויה שמציגה את איחוד לוגיקת סריקות לסריקה מתקדמת בצורה אינטואיטיבית עם היררכיה ברורה.",
        "dev_lead": "לפרק את איחוד לוגיקת סריקות לסריקה מתקדמת למודול עצמאי עם בדיקות יחידה ואינטגרציה לפני עלייה לסביבה חיה.",
        "product_lead": "להגדיר KPI מדיד ל-איחוד לוגיקת סריקות לסריקה מתקדמת ולוודא התאמה ליעדים הרבעוניים.",
        "microcopy": "שם התכונה והכפתורים סביב איחוד לוגיקת סריקות לסריקה מתקדמת צריכים להיות בהירים, מזמינים ונטולי ז'רגון."
      },
      "priority": "רגיל",
      "complexity": "מורכב",
      "effort_minutes": 195,
      "status": "in_progress",
      "created_at": "2025-10-04 17:34:40.004482",
      "updated_at": "2025-10-04T22:26:32.538882"
    },
    {
      "id": "097081bf-791b-45a0-af41-99b6c560b27c",
      "subject": "מעקב חיים אחר סריקה בצד השרת",
      "subtasks": [
        "איסוף דרישות והגדרת מדדי הצלחה ל-מעקב חיים אחר סריקה בצד השרת",
        "פיתוח והטמעה של מעקב חיים אחר סריקה בצד השרת",
        "בדיקות, fine tuning והשקה מבוקרת עבור מעקב חיים אחר סריקה בצד השרת"
      ],
      "expert_review": {
        "design_lead": "לבנות חוויה שמציגה את מעקב חיים אחר סריקה בצד השרת בצורה אינטואיטיבית עם היררכיה ברורה.",
        "dev_lead": "לפרק את מעקב חיים אחר סריקה בצד השרת למודול עצמאי עם בדיקות יחידה ואינטגרציה לפני עלייה לסביבה חיה.",
        "product_lead": "להגדיר KPI מדיד ל-מעקב חיים אחר סריקה בצד השרת ולוודא התאמה ליעדים הרבעוניים.",
        "microcopy": "שם התכונה והכפתורים סביב מעקב חיים אחר סריקה בצד השרת צריכים להיות בהירים, מזמינים ונטולי ז'רגון."
      },
      "priority": "רגיל",
      "complexity": "מורכב",
      "effort_minutes": 165,
      "status": "pending",
      "created_at": "2025-10-04 17:34:40.004528",
      "updated_at": "2025-10-04 17:34:40.004528"
    },
    {
      "id": "56dacd0e-a6b3-4eaa-bfe5-d580e3541c07",
      "subject": "ספריית טקסטים אחידה לחוויית המשתמש",
      "subtasks": [
        "איסוף דרישות והגדרת מדדי הצלחה ל-ספריית טקסטים אחידה לחוויית המשתמש",
        "פיתוח והטמעה של ספריית טקסטים אחידה לחוויית המשתמש",
        "בדיקות, fine tuning והשקה מבוקרת עבור ספריית טקסטים אחידה לחוויית המשתמש"
      ],
      "expert_review": {
        "design_lead": "לבנות חוויה שמציגה את ספריית טקסטים אחידה לחוויית המשתמש בצורה אינטואיטיבית עם היררכיה ברורה.",
        "dev_lead": "לפרק את ספריית טקסטים אחידה לחוויית המשתמש למודול עצמאי עם בדיקות יחידה ואינטגרציה לפני עלייה לסביבה חיה.",
        "product_lead": "להגדיר KPI מדיד ל-ספריית טקסטים אחידה לחוויית המשתמש ולוודא התאמה ליעדים הרבעוניים.",
        "microcopy": "שם התכונה והכפתורים סביב ספריית טקסטים אחידה לחוויית המשתמש צריכים להיות בהירים, מזמינים ונטולי ז'רגון."
      },
      "priority": "רגיל",
      "complexity": "מורכב",
      "effort_minutes": 210,
      "status": "pending",
      "created_at": "2025-10-04 17:34:40.004542",
      "updated_at": "2025-10-04 17:34:40.004542"
    },
    {
      "id": "2f339d8a-85e7-43b0-9d10-6988ecaa12d5",
      "subject": "במסך שליחת לקבוצות, לאפשר לפלטר רק קבוצות שלא שלחתי אליהם יותר משעה הודעה",
      "subtasks": [
        "איסוף דרישות והגדרת מדדי הצלחה ל-במסך שליחת לקבוצות, לאפשר לפלטר רק קבוצות שלא שלחתי אליהם יותר משעה הודעה",
        "פיתוח והטמעה של במסך שליחת לקבוצות, לאפשר לפלטר רק קבוצות שלא שלחתי אליהם יותר משעה הודעה",
        "בדיקות, fine tuning והשקה מבוקרת עבור במסך שליחת לקבוצות, לאפשר לפלטר רק קבוצות שלא שלחתי אליהם יותר משעה הודעה"
      ],
      "expert_review": {
        "design_lead": "לבנות חוויה שמציגה את במסך שליחת לקבוצות, לאפשר לפלטר רק קבוצות שלא שלחתי אליהם יותר משעה הודעה בצורה אינטואיטיבית עם היררכיה ברורה.",
        "dev_lead": "לפרק את במסך שליחת לקבוצות, לאפשר לפלטר רק קבוצות שלא שלחתי אליהם יותר משעה הודעה למודול עצמאי עם בדיקות יחידה ואינטגרציה לפני עלייה לסביבה חיה.",
        "product_lead": "להגדיר KPI מדיד ל-במסך שליחת לקבוצות, לאפשר לפלטר רק קבוצות שלא שלחתי אליהם יותר משעה הודעה ולוודא התאמה ליעדים הרבעוניים.",
        "microcopy": "שם התכונה והכפתורים סביב במסך שליחת לקבוצות, לאפשר לפלטר רק קבוצות שלא שלחתי אליהם יותר משעה הודעה צריכים להיות בהירים, מזמינים ונטולי ז'רגון."
      },
      "priority": "רגיל",
      "complexity": "קל",
      "effort_minutes": 15,
      "status": "pending",
      "created_at": "2025-10-04 19:27:41.157977",
      "updated_at": "2025-10-04T19:28:10.086956"
    },
    {
      "id": "477ae9b4-5b71-460b-91b2-ffce643a0d3c",
      "subject": "הוספת כפתור אחד שמתחבר לכל החשבונות ביחד במקום להתחבר אחד אחרי השני",
      "subtasks": [
        "איסוף דרישות והגדרת מדדי הצלחה ל-הוספת כפתור אחד שמתחבר לכל החשבונות ביחד במקום להתחבר אחד אחרי השני",
        "פיתוח והטמעה של הוספת כפתור אחד שמתחבר לכל החשבונות ביחד במקום להתחבר אחד אחרי השני",
        "בדיקות, fine tuning והשקה מבוקרת עבור הוספת כפתור אחד שמתחבר לכל החשבונות ביחד במקום להתחבר אחד אחרי השני"
      ],
      "expert_review": {
        "design_lead": "לבנות חוויה שמציגה את הוספת כפתור אחד שמתחבר לכל החשבונות ביחד במקום להתחבר אחד אחרי השני בצורה אינטואיטיבית עם היררכיה ברורה.",
        "dev_lead": "לפרק את הוספת כפתור אחד שמתחבר לכל החשבונות ביחד במקום להתחבר אחד אחרי השני למודול עצמאי עם בדיקות יחידה ואינטגרציה לפני עלייה לסביבה חיה.",
        "product_lead": "להגדיר KPI מדיד ל-הוספת כפתור אחד שמתחבר לכל החשבונות ביחד במקום להתחבר אחד אחרי השני ולוודא התאמה ליעדים הרבעוניים.",
        "microcopy": "שם התכונה והכפתורים סביב הוספת כפתור אחד שמתחבר לכל החשבונות ביחד במקום להתחבר אחד אחרי השני צריכים להיות בהירים, מזמינים ונטולי ז'רגון."
      },
      "attachments": [],
      "priority": "רגיל",
      "complexity": "מורכב מאוד",
      "effort_minutes": 360,
      "status": "completed",
      "created_at": "2025-10-04 19:34:27.442943",
      "updated_at": "2025-11-13T22:00:13.473702",
      "last_executed_at": null,
      "execution_log": []
    },
    {
      "id": "ba5292a1-d719-45aa-8c82-5896195bbb06",
      "subject": "יצירת דיזיין סיסטם קבוע לכל אורך האפליקציה. למשל: כפתורי איקס שונים לחלוטין בכל חלון, אין גדלים קבועים, פונטים או צבעוניות משמעותית שחוזרת על עצמה",
      "subtasks": [
        "איסוף דרישות והגדרת מדדי הצלחה ל-יצירת דיזיין סיסטם קבוע לכל אורך האפליקציה. למשל: כפתורי איקס שונים לחלוטין בכל חלון, אין גדלים קבועים, פונטים או צבעוניות משמעותית שחוזרת על עצמה",
        "פיתוח והטמעה של יצירת דיזיין סיסטם קבוע לכל אורך האפליקציה. למשל: כפתורי איקס שונים לחלוטין בכל חלון, אין גדלים קבועים, פונטים או צבעוניות משמעותית שחוזרת על עצמה",
        "בדיקות, fine tuning והשקה מבוקרת עבור יצירת דיזיין סיסטם קבוע לכל אורך האפליקציה. למשל: כפתורי איקס שונים לחלוטין בכל חלון, אין גדלים קבועים, פונטים או צבעוניות משמעותית שחוזרת על עצמה"
      ],
      "expert_review": {
        "design_lead": "לבנות חוויה שמציגה את יצירת דיזיין סיסטם קבוע לכל אורך האפליקציה. למשל: כפתורי איקס שונים לחלוטין בכל חלון, אין גדלים קבועים, פונטים או צבעוניות משמעותית שחוזרת על עצמה בצורה אינטואיטיבית עם היררכיה ברורה.",
        "dev_lead": "לפרק את יצירת דיזיין סיסטם קבוע לכל אורך האפליקציה. למשל: כפתורי איקס שונים לחלוטין בכל חלון, אין גדלים קבועים, פונטים או צבעוניות משמעותית שחוזרת על עצמה למודול עצמאי עם בדיקות יחידה ואינטגרציה לפני עלייה לסביבה חיה.",
        "product_lead": "להגדיר KPI מדיד ל-יצירת דיזיין סיסטם קבוע לכל אורך האפליקציה. למשל: כפתורי איקס שונים לחלוטין בכל חלון, אין גדלים קבועים, פונטים או צבעוניות משמעותית שחוזרת על עצמה ולוודא התאמה ליעדים הרבעוניים.",
        "microcopy": "שם התכונה והכפתורים סביב יצירת דיזיין סיסטם קבוע לכל אורך האפליקציה. למשל: כפתורי איקס שונים לחלוטין בכל חלון, אין גדלים קבועים, פונטים או צבעוניות משמעותית שחוזרת על עצמה צריכים להיות בהירים, מזמינים ונטולי ז'רגון."
      },
      "priority": "נמוך",
      "complexity": "מורכב מאוד",
      "effort_minutes": 360,
      "status": "pending",
      "created_at": "2025-10-04 22:25:07.965384",
      "updated_at": "2025-10-04 22:25:07.965384"
    },
    {
      "id": "45030741-9f75-4766-9a1f-89ee7e9be151",
      "subject": "לכל מסך הוסף את הבקלוג ענן",
      "subtasks": [
        "איסוף דרישות והגדרת מדדי הצלחה ל-לכל מסך הוסף את הבקלוג ענן",
        "פיתוח והטמעה של לכל מסך הוסף את הבקלוג ענן",
        "בדיקות, fine tuning והשקה מבוקרת עבור לכל מסך הוסף את הבקלוג ענן"
      ],
      "expert_review": {
        "design_lead": "לבנות חוויה שמציגה את לכל מסך הוסף את הבקלוג ענן בצורה אינטואיטיבית עם היררכיה ברורה.",
        "dev_lead": "לפרק את לכל מסך הוסף את הבקלוג ענן למודול עצמאי עם בדיקות יחידה ואינטגרציה לפני עלייה לסביבה חיה.",
        "product_lead": "להגדיר KPI מדיד ל-לכל מסך הוסף את הבקלוג ענן ולוודא התאמה ליעדים הרבעוניים.",
        "microcopy": "שם התכונה והכפתורים סביב לכל מסך הוסף את הבקלוג ענן צריכים להיות בהירים, מזמינים ונטולי ז'רגון."
      },
      "attachments": [],
      "priority": "רגיל",
      "complexity": "מורכב",
      "effort_minutes": 150,
      "status": "completed",
      "created_at": "2025-10-21 05:05:27.583595",
      "updated_at": "2025-10-21T06:04:59.019115",
      "last_executed_at": null,
      "execution_log": []
    },
    {
      "id": "578019c5-3001-42d3-b4b3-9d3691bff29f",
      "subject": "לכל כפתור בעמוד הסריקה  הוסף טולטיפ עם טקסט שמסביר מה עושה הכפתור במעבר עכבר מעליו. הטולטיפ יופיע רק אחרי 1.3 שניות במעבר עכבר על הכפתור.",
      "subtasks": [
        "איסוף דרישות והגדרת מדדי הצלחה ל-לכל כפתור בעמוד הסריקה  הוסף טולטיפ עם טקסט שמסביר מה עושה הכפתור במעבר עכבר מעליו. הטולטיפ יופיע רק אחרי 1.3 שניות במעבר עכבר על הכפתור.",
        "פיתוח והטמעה של לכל כפתור בעמוד הסריקה  הוסף טולטיפ עם טקסט שמסביר מה עושה הכפתור במעבר עכבר מעליו. הטולטיפ יופיע רק אחרי 1.3 שניות במעבר עכבר על הכפתור.",
        "בדיקות, fine tuning והשקה מבוקרת עבור לכל כפתור בעמוד הסריקה  הוסף טולטיפ עם טקסט שמסביר מה עושה הכפתור במעבר עכבר מעליו. הטולטיפ יופיע רק אחרי 1.3 שניות במעבר עכבר על הכפתור."
      ],
      "expert_review": {
        "design_lead": "לבנות חוויה שמציגה את לכל כפתור בעמוד הסריקה  הוסף טולטיפ עם טקסט שמסביר מה עושה הכפתור במעבר עכבר מעליו. הטולטיפ יופיע רק אחרי 1.3 שניות במעבר עכבר על הכפתור. בצורה אינטואיטיבית עם היררכיה ברורה.",
        "dev_lead": "לפרק את לכל כפתור בעמוד הסריקה  הוסף טולטיפ עם טקסט שמסביר מה עושה הכפתור במעבר עכבר מעליו. הטולטיפ יופיע רק אחרי 1.3 שניות במעבר עכבר על הכפתור. למודול עצמאי עם בדיקות יחידה ואינטגרציה לפני עלייה לסביבה חיה.",
        "product_lead": "להגדיר KPI מדיד ל-לכל כפתור בעמוד הסריקה  הוסף טולטיפ עם טקסט שמסביר מה עושה הכפתור במעבר עכבר מעליו. הטולטיפ יופיע רק אחרי 1.3 שניות במעבר עכבר על הכפתור. ולוודא התאמה ליעדים הרבעוניים.",
        "microcopy": "שם התכונה והכפתורים סביב לכל כפתור בעמוד הסריקה  הוסף טולטיפ עם טקסט שמסביר מה עושה הכפתור במעבר עכבר מעליו. הטולטיפ יופיע רק אחרי 1.3 שניות במעבר עכבר על הכפתור. צריכים להיות בהירים, מזמינים ונטולי ז'רגון."
      },
      "attachments": [],
      "priority": "דחוף",
      "complexity": "מורכב מאוד",
      "effort_minutes": 360,
      "status": "pending",
      "created_at": "2025-10-21 05:07:34.251076",
      "updated_at": "2025-10-21 05:07:34.251076"
    }
  ],
  "questions": [
    {
      "id": "9d78f99d-32c5-4acb-9055-7dc4e9e4bbb5",
      "content": "לא צריך ללחוץ ערוך. אני פשוט אבחר רכיב שהוא ניתן לעריכה כמו טקסט או מאפיין ובלחיצה עליו אני אוכל לבחור אופציות עריכה או לשנות טקסט. מה דעתך?",
      "created_at": "2025-10-04T17:50:36.335574"
    }
  ]
}